[
  "00",
  "000",
  "0000",
  "000000",
  "001",
  "0010",
  "0011",
  "01",
  "0100",
  "02",
  "0200",
  "03",
  "04",
  "0400",
  "05",
  "0500",
  "06",
  "07",
  "0700",
  "08",
  "09",
  "10",
  "100",
  "1000",
  "10000",
  "101",
  "105",
  "10th",
  "11",
  "110",
  "115",
  "11th",
  "12",
  "120",
  "1200",
  "125",
  "13",
  "130",
  "135",
  "14",
  "140",
  "1400",
  "149",
  "15",
  "150",
  "1500",
  "15th",
  "16",
  "160",
  "1618",
  "17",
  "170",
  "18",
  "180",
  "1800",
  "19",
  "1933",
  "1934",
  "1980",
  "1982",
  "1984",
  "1985",
  "1986",
  "1987",
  "1988",
  "1989",
  "1990",
  "1991",
  "1992",
  "1993",
  "1994",
  "1995",
  "1996",
  "1997",
  "1998",
  "1999",
  "19th",
  "1st",
  "20",
  "200",
  "2000",
  "2001",
  "2002",
  "2003",
  "2004",
  "2005",
  "202",
  "207",
  "209",
  "20th",
  "21",
  "212",
  "215",
  "21st",
  "22",
  "220",
  "23",
  "24",
  "240",
  "25",
  "250",
  "26",
  "27",
  "272",
  "28",
  "29",
  "2nd",
  "30",
  "300",
  "3000",
  "301",
  "3010",
  "30pm",
  "30th",
  "31",
  "32",
  "320",
  "33",
  "34",
  "35",
  "350",
  "36",
  "37",
  "38",
  "39",
  "3d",
  "3px",
  "3rd",
  "40",
  "400",
  "4000",
  "41",
  "412",
  "415",
  "42",
  "43",
  "44",
  "45",
  "46",
  "468",
  "47",
  "48",
  "49",
  "4px",
  "4th",
  "50",
  "500",
  "5000",
  "501",
  "51",
  "512",
  "52",
  "53",
  "54",
  "55",
  "550",
  "55619",
  "56",
  "57",
  "58",
  "59",
  "5th",
  "60",
  "600",
  "61",
  "62",
  "63",
  "64",
  "646",
  "65",
  "650",
  "66",
  "67",
  "68",
  "69",
  "70",
  "700",
  "713",
  "72",
  "73",
  "74",
  "75",
  "750",
  "76",
  "78",
  "79",
  "7th",
  "80",
  "800",
  "81",
  "82",
  "83",
  "84",
  "85",
  "853",
  "86",
  "87",
  "88",
  "89",
  "8th",
  "90",
  "900",
  "914",
  "92",
  "93",
  "94",
  "95",
  "96",
  "97",
  "98",
  "99",
  "9th",
  "a4",
  "aa",
  "ab",
  "ability",
  "able",
  "about",
  "above",
  "abroad",
  "absence",
  "absolute",
  "absolutely",
  "abstract",
  "abstracts",
  "abuse",
  "ac",
  "academic",
  "academy",
  "accent",
  "accept",
  "acceptable",
  "acceptance",
  "accepted",
  "access",
  "accessible",
  "accessing",
  "accommodation",
  "accomodation",
  "accompanied",
  "accompanying",
  "according",
  "account",
  "accounting",
  "accounts",
  "accuracy",
  "accurate",
  "accurately",
  "accusative",
  "achieve",
  "achieved",
  "acl",
  "acl99",
  "acoustic",
  "acquire",
  "acquired",
  "acquiring",
  "acquisition",
  "acrobat",
  "across",
  "act",
  "action",
  "actions",
  "active",
  "actively",
  "activities",
  "activity",
  "acts",
  "actual",
  "actually",
  "ad",
  "adam",
  "adaptive",
  "add",
  "added",
  "adding",
  "addition",
  "additional",
  "additionally",
  "address",
  "addressed",
  "addresses",
  "addressing",
  "adds",
  "adequate",
  "adjectives",
  "administration",
  "administrative",
  "adobe",
  "ads",
  "adult",
  "adults",
  "advance",
  "advanced",
  "advances",
  "advantage",
  "advertise",
  "advertisement",
  "advertising",
  "advice",
  "advise",
  "advised",
  "advises",
  "advisor",
  "advisory",
  "aep",
  "affairs",
  "affect",
  "affected",
  "affiliate",
  "affiliated",
  "affiliates",
  "affiliation",
  "affixes",
  "afford",
  "affordable",
  "afraid",
  "africa",
  "african",
  "after",
  "afternoon",
  "ag",
  "again",
  "against",
  "age",
  "agencies",
  "agency",
  "agenda",
  "agent",
  "agents",
  "aggressive",
  "aging",
  "ago",
  "agree",
  "agreed",
  "agreement",
  "agreements",
  "ahead",
  "ai",
  "aid",
  "ail",
  "aim",
  "aimee",
  "aims",
  "air",
  "airport",
  "aisb",
  "al",
  "alan",
  "alberta",
  "album",
  "alert",
  "alex",
  "alexis",
  "algonquian",
  "algorithm",
  "algorithms",
  "ali",
  "alias",
  "alice",
  "align",
  "all",
  "allen",
  "allocated",
  "allocation",
  "allow",
  "allowed",
  "allowing",
  "allows",
  "almost",
  "alone",
  "along",
  "already",
  "also",
  "alter",
  "alternative",
  "although",
  "always",
  "am",
  "amazing",
  "amendment",
  "america",
  "american",
  "americans",
  "americas",
  "amherst",
  "amid",
  "among",
  "amount",
  "amounts",
  "amsterdam",
  "amy",
  "an",
  "ana",
  "analogy",
  "analyses",
  "analysis",
  "analyst",
  "analysts",
  "anaphora",
  "ancient",
  "ancillary",
  "and",
  "andersen",
  "anderson",
  "andrea",
  "andrew",
  "andy",
  "angeles",
  "animal",
  "animals",
  "anita",
  "ann",
  "anna",
  "anne",
  "anniversary",
  "announce",
  "announced",
  "announcement",
  "announcements",
  "announces",
  "annual",
  "anonymous",
  "another",
  "answer",
  "answers",
  "anthony",
  "anthropological",
  "anthropology",
  "anti",
  "anticipated",
  "anticipates",
  "antonio",
  "any",
  "anybody",
  "anymore",
  "anyone",
  "anything",
  "anytime",
  "anyway",
  "anywhere",
  "aol",
  "apart",
  "apologies",
  "apologize",
  "apparent",
  "apparently",
  "appeal",
  "appear",
  "appeared",
  "appears",
  "apple",
  "applicants",
  "application",
  "applications",
  "applied",
  "applies",
  "apply",
  "applying",
  "appointment",
  "appreciate",
  "appreciated",
  "approach",
  "approaches",
  "appropriate",
  "approval",
  "approved",
  "approx",
  "approximately",
  "apr",
  "april",
  "apt",
  "ar",
  "arabic",
  "architecture",
  "archive",
  "are",
  "area",
  "areas",
  "arent",
  "argue",
  "argued",
  "argues",
  "argument",
  "arguments",
  "arial",
  "arise",
  "arizona",
  "arm",
  "arnold",
  "around",
  "arrange",
  "arranged",
  "arrangement",
  "arrangements",
  "arrival",
  "arrive",
  "art",
  "arthur",
  "article",
  "articles",
  "artificial",
  "arts",
  "as",
  "asap",
  "ascii",
  "asia",
  "asian",
  "aside",
  "ask",
  "asked",
  "asking",
  "asl",
  "aspect",
  "aspects",
  "assembly",
  "assessment",
  "asset",
  "assets",
  "assigned",
  "assignment",
  "assist",
  "assistance",
  "assistant",
  "associate",
  "associated",
  "associates",
  "association",
  "assume",
  "assumed",
  "assumes",
  "assuming",
  "assumption",
  "assumptions",
  "assurance",
  "assured",
  "at",
  "atoll",
  "att",
  "attached",
  "attachment",
  "attachments",
  "attack",
  "attacks",
  "attempt",
  "attempts",
  "attend",
  "attendance",
  "attending",
  "attention",
  "attitudes",
  "attorney",
  "attract",
  "attractive",
  "au",
  "auction",
  "audience",
  "audio",
  "audit",
  "aug",
  "august",
  "aus",
  "austin",
  "australia",
  "australian",
  "austria",
  "author",
  "authority",
  "authors",
  "auto",
  "automated",
  "automatic",
  "automatically",
  "automation",
  "aux",
  "availability",
  "available",
  "ave",
  "avec",
  "avenue",
  "average",
  "aviv",
  "avoid",
  "award",
  "awarded",
  "aware",
  "away",
  "ba",
  "baby",
  "back",
  "background",
  "backup",
  "bad",
  "balance",
  "ball",
  "bandwidth",
  "bank",
  "banking",
  "bankruptcy",
  "banks",
  "bar",
  "barbara",
  "barcelona",
  "bare",
  "barry",
  "base",
  "based",
  "basic",
  "basically",
  "basin",
  "basis",
  "basque",
  "batch",
  "bay",
  "bb",
  "be",
  "beach",
  "bear",
  "beat",
  "beautiful",
  "became",
  "because",
  "beck",
  "become",
  "becomes",
  "becoming",
  "bed",
  "been",
  "before",
  "began",
  "begin",
  "beginning",
  "begins",
  "begun",
  "behalf",
  "behavior",
  "behaviour",
  "behind",
  "being",
  "belgium",
  "belief",
  "beliefs",
  "believe",
  "believed",
  "believes",
  "bell",
  "below",
  "ben",
  "benefit",
  "benefits",
  "benjamins",
  "berkeley",
  "berlin",
  "bernard",
  "besides",
  "best",
  "bet",
  "beta",
  "beth",
  "better",
  "between",
  "beyond",
  "bibliography",
  "bid",
  "big",
  "bigger",
  "biggest",
  "bilingual",
  "bilingualism",
  "bill",
  "billing",
  "billion",
  "bills",
  "binary",
  "binding",
  "bird",
  "birmingham",
  "bit",
  "bitnet",
  "bits",
  "biz",
  "black",
  "blackwell",
  "blank",
  "blind",
  "block",
  "blocks",
  "blog",
  "blood",
  "bloomberg",
  "blue",
  "blvd",
  "board",
  "bob",
  "body",
  "bold",
  "bolzano",
  "bond",
  "bonds",
  "bonn",
  "bonus",
  "bonuses",
  "book",
  "booking",
  "books",
  "boost",
  "boot",
  "border",
  "born",
  "boss",
  "boston",
  "botanical",
  "both",
  "bottle",
  "bottom",
  "bought",
  "bound",
  "boundaries",
  "boundary",
  "box",
  "boxes",
  "boy",
  "boyfriend",
  "bp",
  "br",
  "brain",
  "branch",
  "brand",
  "brazil",
  "break",
  "breakfast",
  "breaking",
  "breaks",
  "brent",
  "brian",
  "bridge",
  "brief",
  "briefly",
  "brighton",
  "bring",
  "bringing",
  "brings",
  "britain",
  "british",
  "broad",
  "broadband",
  "broadcast",
  "broken",
  "broker",
  "brother",
  "brought",
  "brown",
  "browser",
  "bruce",
  "bryan",
  "bucks",
  "budget",
  "bug",
  "build",
  "building",
  "built",
  "bulgaria",
  "bulk",
  "bulletin",
  "burn",
  "bus",
  "bush",
  "business",
  "businesses",
  "busy",
  "but",
  "button",
  "buy",
  "buyer",
  "buyers",
  "buying",
  "by",
  "bythinkgeek",
  "ca",
  "cable",
  "cal",
  "calendar",
  "calger",
  "california",
  "call",
  "called",
  "calling",
  "calls",
  "calpine",
  "cambridge",
  "came",
  "camera",
  "cameraready",
  "campaign",
  "campus",
  "can",
  "canada",
  "canadian",
  "cancer",
  "candidate",
  "candidates",
  "cannot",
  "canon",
  "cant",
  "cap",
  "capabilities",
  "capable",
  "capacity",
  "capital",
  "capitalfm",
  "capture",
  "car",
  "card",
  "cards",
  "care",
  "career",
  "careful",
  "carefully",
  "carl",
  "carlos",
  "carnegie",
  "carnie",
  "carol",
  "carolina",
  "carried",
  "carry",
  "cars",
  "cartridge",
  "case",
  "cases",
  "cash",
  "casino",
  "cat",
  "catalan",
  "catalogue",
  "catch",
  "categorial",
  "categories",
  "category",
  "catherine",
  "cause",
  "caused",
  "causes",
  "cc",
  "cd",
  "cdrom",
  "cds",
  "ce",
  "cell",
  "cent",
  "center",
  "central",
  "centre",
  "cents",
  "century",
  "ceo",
  "cera",
  "certain",
  "certainly",
  "cf",
  "cfo",
  "cfp",
  "ch",
  "chain",
  "chair",
  "chairman",
  "chairs",
  "challenge",
  "challenges",
  "chance",
  "chances",
  "change",
  "changed",
  "changes",
  "changing",
  "channel",
  "channels",
  "chapter",
  "chapters",
  "character",
  "characteristics",
  "characters",
  "charge",
  "charged",
  "charges",
  "charles",
  "charset",
  "chase",
  "chat",
  "cheap",
  "check",
  "checked",
  "checking",
  "checks",
  "cheng",
  "cheque",
  "chicago",
  "chief",
  "child",
  "children",
  "china",
  "chinese",
  "choice",
  "chomsky",
  "choose",
  "chosen",
  "chris",
  "christian",
  "christie",
  "christmas",
  "christopher",
  "church",
  "cialis",
  "cindy",
  "circle",
  "circular",
  "circumstances",
  "cis",
  "cited",
  "cities",
  "citizens",
  "city",
  "civil",
  "cl",
  "claim",
  "claimed",
  "claiming",
  "claims",
  "clark",
  "class",
  "classes",
  "classic",
  "classical",
  "classification",
  "classified",
  "classroom",
  "clause",
  "clauses",
  "clean",
  "clear",
  "clearance",
  "clearly",
  "click",
  "clicking",
  "client",
  "clients",
  "clitic",
  "clitics",
  "clock",
  "close",
  "closed",
  "closely",
  "closer",
  "closing",
  "cloth",
  "club",
  "cm",
  "cmu",
  "cnet",
  "cnrs",
  "co",
  "coast",
  "code",
  "codes",
  "coffee",
  "cognition",
  "cognitive",
  "cogs",
  "cogsci",
  "cold",
  "colingacl",
  "collaboration",
  "collapse",
  "collateral",
  "colleague",
  "colleagues",
  "collect",
  "collected",
  "collection",
  "college",
  "collins",
  "colloquial",
  "colloquium",
  "color",
  "colorado",
  "columbia",
  "column",
  "com",
  "combination",
  "combined",
  "come",
  "comes",
  "comfort",
  "comfortable",
  "coming",
  "command",
  "comme",
  "comment",
  "commentary",
  "comments",
  "commerce",
  "commercial",
  "commission",
  "commitment",
  "committed",
  "committee",
  "commodities",
  "commodity",
  "common",
  "commonly",
  "communicate",
  "communication",
  "communications",
  "communicative",
  "communities",
  "community",
  "comp",
  "companies",
  "company",
  "companys",
  "compaq",
  "comparative",
  "compare",
  "compared",
  "comparing",
  "comparison",
  "comparisons",
  "compatible",
  "compensation",
  "competence",
  "competition",
  "competitive",
  "competitors",
  "compile",
  "compiled",
  "complaints",
  "complement",
  "complete",
  "completed",
  "completely",
  "completion",
  "complex",
  "complexity",
  "compliance",
  "complicated",
  "component",
  "components",
  "composition",
  "compounds",
  "comprehension",
  "comprehensive",
  "compuserve",
  "computation",
  "computational",
  "computer",
  "computers",
  "computing",
  "computron",
  "con",
  "concept",
  "concepts",
  "conceptual",
  "concern",
  "concerned",
  "concerning",
  "concerns",
  "conclusion",
  "conclusions",
  "condition",
  "conditions",
  "conduct",
  "conducted",
  "conf",
  "conference",
  "conferences",
  "confidence",
  "confident",
  "confidential",
  "confidentiality",
  "configuration",
  "confirm",
  "confirmation",
  "confirmed",
  "conflict",
  "congratulations",
  "congress",
  "conjunction",
  "connect",
  "connected",
  "connecticut",
  "connection",
  "connections",
  "consequences",
  "conservative",
  "consider",
  "considerable",
  "consideration",
  "considerations",
  "considered",
  "considering",
  "consist",
  "consistent",
  "consists",
  "consonant",
  "consonants",
  "consortium",
  "constitute",
  "constitutes",
  "constraint",
  "constraints",
  "construct",
  "construction",
  "constructions",
  "construed",
  "consult",
  "consultant",
  "consultation",
  "consulting",
  "consumer",
  "consumers",
  "contact",
  "contacted",
  "contacting",
  "contacts",
  "contain",
  "contained",
  "containing",
  "contains",
  "contemporary",
  "content",
  "contents",
  "context",
  "contexts",
  "continental",
  "continue",
  "continued",
  "continues",
  "continuing",
  "contract",
  "contracts",
  "contrary",
  "contrast",
  "contrastive",
  "contribute",
  "contributed",
  "contribution",
  "contributions",
  "contributors",
  "control",
  "controlled",
  "controls",
  "controversial",
  "convenience",
  "convenient",
  "convention",
  "conversation",
  "conversational",
  "conversations",
  "cook",
  "cool",
  "cooperation",
  "coordination",
  "coordinator",
  "copies",
  "copy",
  "copyright",
  "core",
  "coreference",
  "corel",
  "cornell",
  "corner",
  "corp",
  "corpora",
  "corporate",
  "corporation",
  "corporations",
  "corpus",
  "corpusbased",
  "correct",
  "correction",
  "correctly",
  "correspondence",
  "corresponding",
  "cost",
  "costs",
  "couid",
  "could",
  "council",
  "count",
  "counter",
  "counterparties",
  "counterparty",
  "counting",
  "countries",
  "country",
  "county",
  "couple",
  "coupon",
  "course",
  "courses",
  "court",
  "cover",
  "coverage",
  "covered",
  "covering",
  "covers",
  "cp",
  "craig",
  "crash",
  "create",
  "created",
  "creating",
  "creation",
  "creative",
  "credit",
  "creditors",
  "crenshaw",
  "creole",
  "creoles",
  "criminal",
  "crisis",
  "criteria",
  "critical",
  "cross",
  "crosslinguistic",
  "crucial",
  "cruise",
  "cs",
  "csli",
  "cultural",
  "culture",
  "cultures",
  "cum",
  "cup",
  "curious",
  "currency",
  "current",
  "currently",
  "curriculum",
  "curve",
  "curves",
  "custom",
  "customer",
  "customers",
  "cut",
  "cutting",
  "cv",
  "cycle",
  "czech",
  "da",
  "dabhol",
  "dagga",
  "daily",
  "dale",
  "dallas",
  "damage",
  "dan",
  "daniel",
  "dans",
  "daren",
  "dark",
  "das",
  "data",
  "database",
  "databases",
  "date",
  "dates",
  "dave",
  "david",
  "davis",
  "day",
  "days",
  "dbcaps",
  "dc",
  "de",
  "dead",
  "deadline",
  "deadlines",
  "deaf",
  "deal",
  "dealer",
  "dealing",
  "dealings",
  "deals",
  "dean",
  "dear",
  "death",
  "debate",
  "deborah",
  "debt",
  "debts",
  "dec",
  "decade",
  "decades",
  "december",
  "decide",
  "decided",
  "deciding",
  "decision",
  "decisions",
  "decline",
  "declined",
  "dedicated",
  "deduction",
  "deep",
  "default",
  "defense",
  "define",
  "defined",
  "definite",
  "definitely",
  "definition",
  "degree",
  "degrees",
  "degruyter",
  "del",
  "delay",
  "delete",
  "deleted",
  "deliver",
  "delivered",
  "deliveries",
  "delivery",
  "dell",
  "demand",
  "demo",
  "democratic",
  "demonstrate",
  "demonstrated",
  "demonstration",
  "demonstrations",
  "demos",
  "den",
  "dennis",
  "department",
  "departments",
  "departure",
  "depend",
  "dependencies",
  "dependency",
  "dependent",
  "depending",
  "depends",
  "deposit",
  "deposited",
  "dept",
  "depth",
  "der",
  "derivation",
  "derivatives",
  "derived",
  "des",
  "describe",
  "described",
  "describes",
  "describing",
  "description",
  "descriptions",
  "descriptive",
  "deserve",
  "design",
  "designated",
  "designed",
  "desirable",
  "desire",
  "desk",
  "desktop",
  "despite",
  "detail",
  "detailed",
  "details",
  "detected",
  "determine",
  "determined",
  "determining",
  "develop",
  "developed",
  "developer",
  "developers",
  "developing",
  "development",
  "developments",
  "device",
  "devices",
  "devoted",
  "dfki",
  "dfl",
  "di",
  "diachronic",
  "diagrams",
  "dial",
  "dialect",
  "dialects",
  "dialogue",
  "dick",
  "dictionaries",
  "dictionary",
  "did",
  "didn",
  "didnt",
  "die",
  "died",
  "diego",
  "differ",
  "difference",
  "differences",
  "different",
  "difficult",
  "difficulty",
  "digital",
  "diligence",
  "dinner",
  "direct",
  "directed",
  "direction",
  "directions",
  "directly",
  "director",
  "directories",
  "directors",
  "directory",
  "disc",
  "discipline",
  "disciplines",
  "disclaimer",
  "disclose",
  "disclosed",
  "disclosure",
  "discount",
  "discounts",
  "discourse",
  "discover",
  "discovered",
  "discovery",
  "discuss",
  "discussed",
  "discusses",
  "discussing",
  "discussion",
  "discussions",
  "disk",
  "display",
  "dissertation",
  "dissertations",
  "distance",
  "distinct",
  "distinction",
  "distribute",
  "distributed",
  "distribution",
  "diverse",
  "diversity",
  "divided",
  "division",
  "dj",
  "dm",
  "do",
  "doc",
  "doctor",
  "doctors",
  "document",
  "documentation",
  "documents",
  "does",
  "doesn",
  "doesnt",
  "dog",
  "doing",
  "dollar",
  "dollars",
  "domain",
  "domains",
  "domestic",
  "don",
  "donald",
  "done",
  "donna",
  "dont",
  "door",
  "doris",
  "dos",
  "dose",
  "double",
  "doubt",
  "dow",
  "down",
  "downgrade",
  "download",
  "downloads",
  "dozen",
  "dpc",
  "dr",
  "draft",
  "dragon",
  "dramatically",
  "draw",
  "drawing",
  "drawn",
  "dream",
  "dreams",
  "drew",
  "drive",
  "driven",
  "driver",
  "drivers",
  "drives",
  "driving",
  "drop",
  "dropped",
  "drug",
  "drugs",
  "du",
  "dublin",
  "due",
  "duke",
  "duration",
  "during",
  "dutch",
  "duty",
  "dvd",
  "dvds",
  "dynamic",
  "dynegy",
  "ea",
  "each",
  "ear",
  "earlier",
  "early",
  "earn",
  "earned",
  "earning",
  "earnings",
  "earth",
  "ease",
  "easier",
  "easiest",
  "easily",
  "east",
  "eastern",
  "easy",
  "eat",
  "eb",
  "ebay",
  "ebs",
  "ec",
  "ecai98",
  "economic",
  "economics",
  "economy",
  "ect",
  "ed",
  "edge",
  "edinburgh",
  "edison",
  "edit",
  "edited",
  "editing",
  "edition",
  "editor",
  "editorial",
  "editors",
  "eds",
  "edu",
  "education",
  "educational",
  "edward",
  "edwards",
  "ee",
  "ees",
  "eff",
  "effect",
  "effective",
  "effectively",
  "effects",
  "efficiency",
  "efficient",
  "effort",
  "efforts",
  "eg",
  "eight",
  "either",
  "el",
  "electric",
  "electricity",
  "electronic",
  "electronically",
  "element",
  "elements",
  "eligible",
  "eliminate",
  "elizabeth",
  "ellen",
  "ellipsis",
  "elra",
  "else",
  "elsewhere",
  "em",
  "email",
  "emailed",
  "emailing",
  "emails",
  "embedded",
  "emerging",
  "emphasis",
  "empire",
  "empirical",
  "employee",
  "employees",
  "employer",
  "employment",
  "empty",
  "ems",
  "en",
  "ena",
  "enable",
  "enclose",
  "enclosed",
  "encoding",
  "encourage",
  "encouraged",
  "end",
  "endangered",
  "ended",
  "ending",
  "ends",
  "ene",
  "energy",
  "engine",
  "engineer",
  "engineering",
  "engines",
  "england",
  "english",
  "enhance",
  "enhanced",
  "enjoy",
  "enough",
  "enquiries",
  "enron",
  "enrononline",
  "enronxgate",
  "ensure",
  "enter",
  "entered",
  "entering",
  "enterprise",
  "enterprises",
  "entertainment",
  "entire",
  "entirely",
  "entities",
  "entitled",
  "entity",
  "entries",
  "entry",
  "envelope",
  "environment",
  "environmental",
  "environments",
  "eol",
  "epmi",
  "equal",
  "equally",
  "equipment",
  "equity",
  "equivalent",
  "er",
  "eric",
  "error",
  "errors",
  "es",
  "eskimo",
  "esl",
  "especially",
  "essential",
  "essentially",
  "essex",
  "esslli",
  "est",
  "establish",
  "established",
  "establishing",
  "estate",
  "estimate",
  "estimated",
  "estimates",
  "et",
  "etc",
  "ethnic",
  "eu",
  "euro",
  "europe",
  "european",
  "evaluate",
  "evaluating",
  "evaluation",
  "even",
  "evening",
  "event",
  "events",
  "eventually",
  "ever",
  "every",
  "everybody",
  "everyday",
  "everyone",
  "everything",
  "evidence",
  "evolution",
  "evolutionary",
  "ews",
  "ex",
  "exact",
  "exactly",
  "examine",
  "examines",
  "example",
  "examples",
  "exceed",
  "excellent",
  "except",
  "exception",
  "excess",
  "exchange",
  "exciting",
  "excluding",
  "exclusive",
  "executed",
  "executive",
  "executives",
  "exercise",
  "exercises",
  "exhibit",
  "exhibition",
  "exist",
  "existence",
  "existing",
  "exists",
  "exit",
  "exmh",
  "expand",
  "expanded",
  "expanding",
  "expansion",
  "expect",
  "expectations",
  "expected",
  "expects",
  "expense",
  "expenses",
  "expensive",
  "experience",
  "experienced",
  "experiences",
  "experimental",
  "experiments",
  "expert",
  "expertise",
  "experts",
  "expiration",
  "explain",
  "explained",
  "explains",
  "explanation",
  "explanations",
  "explicit",
  "explicitly",
  "exploration",
  "explore",
  "exploring",
  "export",
  "exposure",
  "express",
  "expressed",
  "expression",
  "expressions",
  "ext",
  "extend",
  "extended",
  "extension",
  "extensive",
  "extent",
  "external",
  "extra",
  "extraction",
  "extraordinary",
  "extreme",
  "extremely",
  "eye",
  "eyes",
  "face",
  "faces",
  "facilitate",
  "facilities",
  "facility",
  "facing",
  "fact",
  "factor",
  "factors",
  "facts",
  "factual",
  "faculty",
  "fail",
  "failed",
  "failure",
  "fair",
  "fairly",
  "faith",
  "fall",
  "fallen",
  "falling",
  "falls",
  "false",
  "familiar",
  "families",
  "family",
  "famous",
  "fantastic",
  "far",
  "farmer",
  "fashion",
  "fast",
  "faster",
  "fastest",
  "fastow",
  "fat",
  "father",
  "favor",
  "favorite",
  "fax",
  "fear",
  "feature",
  "featured",
  "features",
  "feb",
  "february",
  "federal",
  "fee",
  "feedback",
  "feel",
  "feeling",
  "fees",
  "feet",
  "fell",
  "fellow",
  "felt",
  "female",
  "feminine",
  "ferc",
  "few",
  "ff",
  "ffa",
  "fi",
  "fiction",
  "field",
  "fields",
  "fifth",
  "fight",
  "figure",
  "figured",
  "figures",
  "file",
  "filed",
  "files",
  "filing",
  "filings",
  "fill",
  "filled",
  "film",
  "filter",
  "filtering",
  "final",
  "finally",
  "finance",
  "financial",
  "financially",
  "financing",
  "find",
  "finding",
  "findings",
  "fine",
  "finished",
  "finite",
  "finland",
  "finnish",
  "fire",
  "firm",
  "firms",
  "first",
  "fit",
  "five",
  "fix",
  "fixed",
  "fl",
  "flash",
  "flat",
  "flexibility",
  "flexible",
  "flight",
  "floodgate",
  "floor",
  "floppy",
  "florida",
  "flow",
  "focus",
  "focused",
  "focuses",
  "focusing",
  "folder",
  "folks",
  "follow",
  "followed",
  "following",
  "follows",
  "font",
  "fontfamily",
  "fonts",
  "fontsize",
  "fontweight",
  "food",
  "foot",
  "for",
  "force",
  "forced",
  "forces",
  "foreign",
  "forever",
  "forget",
  "fork",
  "form",
  "formal",
  "format",
  "formation",
  "formats",
  "formed",
  "former",
  "forms",
  "formula",
  "forteanaunsubscribeegroupscom",
  "forth",
  "forthcoming",
  "fortune",
  "forum",
  "forward",
  "forwarded",
  "forwarding",
  "found",
  "foundation",
  "foundations",
  "founded",
  "four",
  "fourth",
  "fox",
  "fr",
  "framework",
  "france",
  "francisco",
  "frank",
  "fred",
  "free",
  "freedom",
  "freiburg",
  "french",
  "frequency",
  "frequent",
  "frequently",
  "fresh",
  "fri",
  "friday",
  "friend",
  "friendly",
  "friends",
  "from",
  "front",
  "ft",
  "ftp",
  "fuel",
  "fuer",
  "full",
  "fully",
  "fun",
  "function",
  "functional",
  "functions",
  "fund",
  "fundamental",
  "funding",
  "funds",
  "further",
  "furthermore",
  "future",
  "futures",
  "fw",
  "fwd",
  "fyi",
  "ga",
  "gain",
  "gained",
  "gains",
  "game",
  "games",
  "gap",
  "garland",
  "gary",
  "gas",
  "gathered",
  "gathering",
  "gave",
  "gb",
  "ge",
  "geek",
  "gender",
  "general",
  "generally",
  "generate",
  "generated",
  "generating",
  "generation",
  "generative",
  "generic",
  "genetic",
  "geneva",
  "genre",
  "genuine",
  "geoffrey",
  "george",
  "georgetown",
  "georgia",
  "german",
  "germanic",
  "germany",
  "gestures",
  "get",
  "gets",
  "getting",
  "giant",
  "gibner",
  "gift",
  "girl",
  "girlfriend",
  "girls",
  "give",
  "given",
  "gives",
  "giving",
  "glad",
  "global",
  "gls",
  "gnu",
  "go",
  "goal",
  "goals",
  "god",
  "goes",
  "going",
  "gold",
  "golden",
  "goldrush",
  "gone",
  "good",
  "google",
  "gordon",
  "got",
  "gotten",
  "gov",
  "government",
  "governments",
  "governor",
  "gr",
  "grade",
  "graduate",
  "grammar",
  "grammars",
  "grammatical",
  "grammaticalization",
  "granada",
  "grand",
  "grant",
  "granted",
  "grants",
  "graphics",
  "graphs",
  "grateful",
  "great",
  "greater",
  "greatest",
  "greatly",
  "greece",
  "greek",
  "green",
  "greenberg",
  "greg",
  "gregory",
  "grenoble",
  "groningen",
  "ground",
  "group",
  "groups",
  "grow",
  "growing",
  "growth",
  "gruyter",
  "guarantee",
  "guaranteed",
  "guess",
  "guest",
  "guide",
  "guidelines",
  "guinea",
  "guy",
  "guys",
  "ha",
  "had",
  "hair",
  "half",
  "hall",
  "hamburg",
  "hand",
  "handbook",
  "handle",
  "handled",
  "handling",
  "hands",
  "hans",
  "happen",
  "happened",
  "happening",
  "happens",
  "happy",
  "hard",
  "hardcopy",
  "hardly",
  "hardware",
  "harris",
  "harry",
  "harvard",
  "has",
  "hat",
  "hate",
  "have",
  "haven",
  "havent",
  "having",
  "hawaii",
  "hb",
  "he",
  "head",
  "headed",
  "header",
  "headers",
  "heads",
  "health",
  "hear",
  "heard",
  "hearing",
  "heart",
  "heaven",
  "heavy",
  "hebrew",
  "height",
  "held",
  "helen",
  "hello",
  "help",
  "helped",
  "helpful",
  "helping",
  "helps",
  "helsinki",
  "helvetica",
  "hence",
  "henry",
  "her",
  "here",
  "herein",
  "heres",
  "hesitate",
  "hey",
  "hfl",
  "hi",
  "hidden",
  "high",
  "higher",
  "highest",
  "highly",
  "hill",
  "him",
  "himself",
  "hire",
  "his",
  "historical",
  "historically",
  "history",
  "hit",
  "hits",
  "hold",
  "holding",
  "holdings",
  "holds",
  "holiday",
  "holidays",
  "holland",
  "home",
  "homeland",
  "homepage",
  "homes",
  "honest",
  "hong",
  "honor",
  "hope",
  "hopefully",
  "hopes",
  "host",
  "hosted",
  "hosting",
  "hot",
  "hotel",
  "hotels",
  "hotmail",
  "hottest",
  "hou",
  "hour",
  "hourahead",
  "hours",
  "house",
  "houston",
  "how",
  "howard",
  "however",
  "hp",
  "hpl",
  "hr",
  "href",
  "hrs",
  "htm",
  "html",
  "http",
  "httpdocsyahoocominfoterms",
  "httplistsfreshrpmsnetmailmanlistinforpmlist",
  "httpslistssourceforgenetlistslistinforazorusers",
  "httpslistssourceforgenetlistslistinfospamassassinsightings",
  "httpslistssourceforgenetlistslistinfospamassassintalk",
  "httpswwwinphoniccomrasprsourceforge1refcode1vs3390",
  "httpthinkgeekcomsf",
  "httpwwwlinuxiemailmanlistinfoilug",
  "httpxentcommailmanlistinfofork",
  "huge",
  "human",
  "humanities",
  "humans",
  "humor",
  "hundred",
  "hundreds",
  "husband",
  "hybrid",
  "hypertext",
  "hypotheses",
  "hypothesis",
  "ia",
  "ian",
  "ibm",
  "ice",
  "icelandic",
  "id",
  "ide",
  "idea",
  "ideal",
  "ideas",
  "identical",
  "identification",
  "identified",
  "identify",
  "identifying",
  "identity",
  "ie",
  "if",
  "ignore",
  "ignored",
  "ii",
  "iii",
  "il",
  "ilan",
  "ill",
  "illegal",
  "illinois",
  "iluglinuxie",
  "im",
  "image",
  "images",
  "imagine",
  "immediate",
  "immediately",
  "impact",
  "implementation",
  "implemented",
  "implications",
  "importance",
  "important",
  "impossible",
  "impression",
  "improve",
  "improved",
  "improvement",
  "in",
  "inc",
  "inch",
  "inches",
  "incl",
  "include",
  "included",
  "includes",
  "including",
  "inclusion",
  "income",
  "incorporated",
  "increase",
  "increased",
  "increases",
  "increasing",
  "increasingly",
  "incredible",
  "indeed",
  "independent",
  "index",
  "india",
  "indian",
  "indiana",
  "indicate",
  "indicated",
  "indicates",
  "indicating",
  "indication",
  "indicative",
  "indigenous",
  "individual",
  "individuals",
  "indo",
  "indonesia",
  "industrial",
  "industries",
  "industry",
  "inexpensive",
  "inference",
  "influence",
  "info",
  "inform",
  "informal",
  "informatik",
  "information",
  "informative",
  "informed",
  "infrastructure",
  "inherent",
  "initial",
  "initially",
  "initiative",
  "inn",
  "innovation",
  "innovative",
  "input",
  "inquiries",
  "inquiry",
  "insert",
  "inside",
  "insider",
  "insights",
  "install",
  "installation",
  "installed",
  "instance",
  "instances",
  "instant",
  "instantly",
  "instead",
  "institut",
  "institute",
  "institution",
  "institutional",
  "institutions",
  "instructed",
  "instruction",
  "instructions",
  "insurance",
  "int",
  "integrated",
  "integration",
  "intel",
  "intellectual",
  "intelligence",
  "intelligent",
  "intend",
  "intended",
  "intent",
  "intention",
  "interaction",
  "interactions",
  "interactive",
  "intercultural",
  "interdisciplinary",
  "interest",
  "interested",
  "interesting",
  "interests",
  "interface",
  "interfaces",
  "internal",
  "international",
  "internet",
  "interpretation",
  "interpreting",
  "intervention",
  "interview",
  "interviews",
  "into",
  "intonation",
  "intro",
  "introduce",
  "introduced",
  "introducing",
  "introduction",
  "introductory",
  "inventory",
  "invest",
  "invested",
  "investigate",
  "investigation",
  "investing",
  "investment",
  "investments",
  "investor",
  "investors",
  "invitation",
  "invite",
  "invited",
  "invites",
  "invoice",
  "invoked",
  "involve",
  "involved",
  "involvement",
  "involves",
  "involving",
  "ion",
  "iowa",
  "ip",
  "ipa",
  "ireland",
  "iris",
  "irish",
  "is",
  "isbn",
  "island",
  "islands",
  "isn",
  "isnt",
  "iso",
  "isp",
  "israel",
  "issue",
  "issued",
  "issues",
  "ist",
  "it",
  "italian",
  "italy",
  "item",
  "items",
  "its",
  "itself",
  "iv",
  "ive",
  "jack",
  "jackie",
  "jackson",
  "jacques",
  "james",
  "jan",
  "jane",
  "janet",
  "january",
  "japan",
  "japanese",
  "jason",
  "java",
  "jay",
  "je",
  "jean",
  "jeff",
  "jeffrey",
  "jennifer",
  "jim",
  "joan",
  "job",
  "jobs",
  "joe",
  "john",
  "johnson",
  "join",
  "joined",
  "joining",
  "joint",
  "jonathan",
  "jones",
  "jordan",
  "jose",
  "joseph",
  "journal",
  "journals",
  "jp",
  "jr",
  "juan",
  "judge",
  "judgment",
  "judgments",
  "jul",
  "julie",
  "july",
  "jump",
  "jun",
  "june",
  "junk",
  "jussieu",
  "just",
  "justin",
  "kaminski",
  "karen",
  "karl",
  "kate",
  "keep",
  "keeping",
  "keeps",
  "keith",
  "kelly",
  "ken",
  "kenneth",
  "kept",
  "kernel",
  "kevin",
  "key",
  "keyboard",
  "keynote",
  "keywords",
  "kids",
  "kim",
  "kimberly",
  "kin",
  "kind",
  "kindly",
  "kinds",
  "king",
  "kingdom",
  "kit",
  "kitchen",
  "kluwer",
  "knew",
  "know",
  "knowing",
  "knowledge",
  "known",
  "knows",
  "kong",
  "korea",
  "korean",
  "l2",
  "la",
  "lab",
  "label",
  "labelled",
  "laboratories",
  "laboratory",
  "labs",
  "lack",
  "lake",
  "lancaster",
  "land",
  "lang",
  "language",
  "languages",
  "langue",
  "langues",
  "laptop",
  "large",
  "largely",
  "larger",
  "largest",
  "larry",
  "las",
  "laser",
  "last",
  "late",
  "later",
  "latest",
  "latex",
  "latin",
  "latter",
  "launch",
  "laura",
  "lavorato",
  "law",
  "lawrence",
  "laws",
  "lawsuit",
  "lawsuits",
  "lawyer",
  "lawyers",
  "lay",
  "ld",
  "le",
  "lead",
  "leader",
  "leaders",
  "leadership",
  "leading",
  "leads",
  "learn",
  "learned",
  "learners",
  "learning",
  "least",
  "leave",
  "leaves",
  "leaving",
  "lecture",
  "lecturer",
  "lectures",
  "led",
  "lee",
  "leeds",
  "left",
  "legal",
  "legally",
  "legislation",
  "legitimate",
  "leiden",
  "lenders",
  "length",
  "les",
  "less",
  "let",
  "lets",
  "letter",
  "letters",
  "leuven",
  "level",
  "levels",
  "lewis",
  "lexical",
  "lexicography",
  "lexicon",
  "lexicons",
  "lf",
  "li",
  "libraries",
  "library",
  "license",
  "licensed",
  "licensing",
  "lies",
  "life",
  "lifetime",
  "light",
  "like",
  "likely",
  "limit",
  "limitations",
  "limited",
  "limits",
  "linda",
  "line",
  "linear",
  "lines",
  "ling",
  "lingua",
  "linguist",
  "linguistic",
  "linguistica",
  "linguistics",
  "linguistique",
  "linguists",
  "link",
  "linked",
  "links",
  "linux",
  "liquidity",
  "lisa",
  "list",
  "listed",
  "listen",
  "listing",
  "listmasterlinuxie",
  "lists",
  "listserv",
  "literacy",
  "literally",
  "literary",
  "literature",
  "litigation",
  "little",
  "live",
  "lives",
  "living",
  "ljm",
  "ll",
  "llc",
  "lloyd",
  "lng",
  "lo",
  "load",
  "loan",
  "loans",
  "local",
  "locate",
  "located",
  "location",
  "locations",
  "lockergnome",
  "log",
  "logic",
  "logical",
  "logics",
  "logistics",
  "logo",
  "logos",
  "lon",
  "london",
  "long",
  "longer",
  "look",
  "looked",
  "looking",
  "looks",
  "los",
  "lose",
  "losing",
  "loss",
  "losses",
  "lost",
  "lot",
  "lots",
  "lottery",
  "louis",
  "louise",
  "love",
  "low",
  "lower",
  "lowest",
  "lrec",
  "lsa",
  "lst",
  "ltd",
  "lu",
  "luck",
  "lucky",
  "lunch",
  "lunches",
  "ma",
  "mac",
  "machine",
  "machines",
  "macintosh",
  "macromedia",
  "made",
  "madrid",
  "magazine",
  "mail",
  "mailbox",
  "mailed",
  "mailer",
  "mailing",
  "mailings",
  "mails",
  "mailto",
  "main",
  "mainly",
  "maintain",
  "maintainer",
  "maintenance",
  "major",
  "majority",
  "make",
  "maker",
  "makes",
  "making",
  "male",
  "man",
  "manage",
  "managed",
  "management",
  "manager",
  "managers",
  "managing",
  "manchester",
  "mandarin",
  "manfred",
  "manner",
  "manual",
  "manufacturer",
  "manufacturing",
  "manuscripts",
  "many",
  "map",
  "mapping",
  "mar",
  "marc",
  "march",
  "margaret",
  "margin",
  "margins",
  "maria",
  "marie",
  "mark",
  "marked",
  "marker",
  "markers",
  "market",
  "marketing",
  "marketplace",
  "markets",
  "marking",
  "marks",
  "marshall",
  "martin",
  "martinez",
  "mary",
  "maryland",
  "mass",
  "massachusetts",
  "massive",
  "master",
  "mastercard",
  "match",
  "matches",
  "matching",
  "materia",
  "material",
  "materially",
  "materials",
  "mathematical",
  "mathematics",
  "matrix",
  "matt",
  "matter",
  "matters",
  "matthew",
  "matthias",
  "max",
  "maximum",
  "may",
  "maybe",
  "mb",
  "mcgill",
  "mcmahon",
  "md",
  "me",
  "mean",
  "meaning",
  "meanings",
  "means",
  "meant",
  "measure",
  "measures",
  "mechanisms",
  "media",
  "medical",
  "medication",
  "medications",
  "medicine",
  "medium",
  "meds",
  "meet",
  "meeting",
  "meetings",
  "melissa",
  "mellon",
  "member",
  "members",
  "membership",
  "memo",
  "memory",
  "men",
  "mental",
  "mention",
  "mentioned",
  "menu",
  "merchant",
  "merely",
  "merge",
  "merger",
  "message",
  "messages",
  "met",
  "metals",
  "metaphor",
  "meter",
  "method",
  "methodological",
  "methodology",
  "methods",
  "mexico",
  "mg",
  "mi",
  "michael",
  "michelle",
  "michigan",
  "microsoft",
  "mid",
  "middle",
  "might",
  "mike",
  "miles",
  "military",
  "millennium",
  "miller",
  "million",
  "millions",
  "mime",
  "min",
  "mind",
  "mine",
  "minimal",
  "minimalist",
  "minimum",
  "mining",
  "minister",
  "ministry",
  "minnesota",
  "minor",
  "minority",
  "minute",
  "minutes",
  "miss",
  "missed",
  "missing",
  "mission",
  "mistake",
  "mit",
  "mitkov",
  "mix",
  "mixed",
  "mlm",
  "mm",
  "mmbtu",
  "mo",
  "mobile",
  "modal",
  "mode",
  "model",
  "modeling",
  "modelling",
  "models",
  "modem",
  "modern",
  "modified",
  "module",
  "moment",
  "mon",
  "monday",
  "money",
  "monitor",
  "month",
  "monthly",
  "months",
  "montreal",
  "mood",
  "moody",
  "moore",
  "more",
  "moreover",
  "morgan",
  "morning",
  "morphological",
  "morphology",
  "morris",
  "mortgage",
  "most",
  "mostly",
  "mother",
  "motivated",
  "motivation",
  "mouse",
  "mouton",
  "move",
  "moved",
  "movement",
  "moves",
  "movie",
  "movies",
  "moving",
  "mp3",
  "mr",
  "mrs",
  "ms",
  "mseb",
  "msn",
  "mt",
  "much",
  "multi",
  "multilevel",
  "multilingual",
  "multimedia",
  "multimodal",
  "multiple",
  "murphy",
  "muscle",
  "music",
  "musical",
  "must",
  "mutual",
  "mw",
  "mx",
  "my",
  "myself",
  "na",
  "name",
  "named",
  "namely",
  "names",
  "nancy",
  "narrative",
  "nat",
  "nation",
  "national",
  "nations",
  "native",
  "natural",
  "naturally",
  "nature",
  "nbsp",
  "nd",
  "ne",
  "near",
  "nearly",
  "necessarily",
  "necessary",
  "need",
  "needed",
  "needs",
  "negation",
  "negative",
  "negotiating",
  "negotiation",
  "negotiations",
  "neil",
  "neither",
  "nels",
  "nelson",
  "net",
  "netco",
  "netherlands",
  "netscape",
  "network",
  "networking",
  "networks",
  "neural",
  "never",
  "nevertheless",
  "new",
  "news",
  "newsletter",
  "newsletters",
  "newspaper",
  "newswires",
  "next",
  "nice",
  "nicholas",
  "nick",
  "nigeria",
  "night",
  "nights",
  "nijmegen",
  "nilotic",
  "nine",
  "nj",
  "nl",
  "nlg",
  "nlp",
  "no",
  "nobody",
  "nom",
  "nominal",
  "nomination",
  "non",
  "none",
  "nor",
  "normal",
  "normally",
  "north",
  "northern",
  "northwest",
  "norton",
  "norway",
  "not",
  "note",
  "noted",
  "notes",
  "nothing",
  "notice",
  "noticed",
  "notification",
  "notified",
  "notify",
  "notion",
  "notions",
  "noun",
  "nouns",
  "nov",
  "novel",
  "november",
  "now",
  "np",
  "nt",
  "null",
  "number",
  "numbers",
  "numerous",
  "ny",
  "object",
  "objective",
  "objectives",
  "objects",
  "obligation",
  "obligations",
  "observed",
  "obtain",
  "obtained",
  "obvious",
  "obviously",
  "occur",
  "occurs",
  "oct",
  "october",
  "oem",
  "of",
  "off",
  "offer",
  "offered",
  "offering",
  "offers",
  "office",
  "officer",
  "officers",
  "offices",
  "official",
  "officials",
  "offshore",
  "often",
  "oh",
  "ohio",
  "oi",
  "oil",
  "ok",
  "old",
  "older",
  "omit",
  "on",
  "once",
  "one",
  "ones",
  "ongoing",
  "online",
  "only",
  "ontario",
  "onto",
  "oo",
  "ooking",
  "ooo",
  "op",
  "open",
  "opened",
  "opening",
  "operate",
  "operating",
  "operation",
  "operational",
  "operations",
  "operator",
  "opinion",
  "opinions",
  "opportunities",
  "opportunity",
  "opposed",
  "opposite",
  "opt",
  "optimality",
  "optin",
  "option",
  "optional",
  "options",
  "or",
  "oral",
  "order",
  "ordered",
  "ordering",
  "orders",
  "ordinary",
  "oregon",
  "org",
  "organisation",
  "organised",
  "organisers",
  "organization",
  "organizations",
  "organized",
  "organizer",
  "organizers",
  "organizing",
  "oriented",
  "origin",
  "original",
  "originally",
  "origination",
  "origins",
  "orthography",
  "os",
  "osdn",
  "otc",
  "other",
  "others",
  "otherwise",
  "ots",
  "ou",
  "our",
  "ourselves",
  "out",
  "outline",
  "outlook",
  "output",
  "outside",
  "outstanding",
  "over",
  "overall",
  "overnight",
  "overseas",
  "overt",
  "overview",
  "owe",
  "own",
  "owned",
  "owner",
  "owners",
  "ownership",
  "owns",
  "oxford",
  "oz",
  "pa",
  "pacific",
  "pack",
  "package",
  "packages",
  "page",
  "pages",
  "paid",
  "pain",
  "pair",
  "paliourg",
  "palm",
  "palmer",
  "panel",
  "panels",
  "paper",
  "paperback",
  "papers",
  "par",
  "para",
  "paradigm",
  "paradigms",
  "paradise",
  "paragraph",
  "parallel",
  "parameter",
  "parameters",
  "parent",
  "parents",
  "paris",
  "park",
  "parser",
  "parsing",
  "part",
  "partial",
  "partially",
  "participant",
  "participants",
  "participate",
  "participating",
  "participation",
  "particles",
  "particular",
  "particularly",
  "parties",
  "partner",
  "partners",
  "partnership",
  "partnerships",
  "parts",
  "party",
  "pas",
  "paso",
  "pass",
  "passed",
  "password",
  "past",
  "paste",
  "pat",
  "patch",
  "patent",
  "path",
  "patricia",
  "patrick",
  "pattern",
  "patterns",
  "paul",
  "pay",
  "payable",
  "paying",
  "payment",
  "payments",
  "paypal",
  "pb",
  "pc",
  "pcs",
  "pdf",
  "peace",
  "peak",
  "pec",
  "pending",
  "penis",
  "pennsylvania",
  "penny",
  "people",
  "peoples",
  "per",
  "percent",
  "percentage",
  "perception",
  "perfect",
  "perfectly",
  "perform",
  "performance",
  "perhaps",
  "period",
  "periods",
  "perl",
  "permanent",
  "permission",
  "person",
  "personal",
  "personally",
  "personnel",
  "persons",
  "perspective",
  "perspectives",
  "pertaining",
  "pesetas",
  "peter",
  "petroleum",
  "pg",
  "pgp",
  "ph",
  "pharmacy",
  "phase",
  "phd",
  "phenomena",
  "phenomenon",
  "phil",
  "philadelphia",
  "philip",
  "philippe",
  "philosophical",
  "philosophy",
  "phone",
  "phones",
  "phonetic",
  "phonetics",
  "phonological",
  "phonology",
  "photo",
  "photos",
  "photoshop",
  "php",
  "phrase",
  "phrases",
  "physical",
  "physics",
  "pick",
  "picks",
  "picture",
  "pictures",
  "pie",
  "piease",
  "piece",
  "pierre",
  "pig",
  "pill",
  "pills",
  "pipe",
  "pipeline",
  "pisin",
  "pittsburgh",
  "pl",
  "place",
  "placed",
  "places",
  "placing",
  "plain",
  "plan",
  "planck",
  "planet",
  "planned",
  "planning",
  "plans",
  "plant",
  "plants",
  "platform",
  "platforms",
  "play",
  "played",
  "player",
  "players",
  "playing",
  "plays",
  "plc",
  "please",
  "pleased",
  "pleasure",
  "plenary",
  "plenty",
  "plural",
  "plus",
  "pm",
  "po",
  "pocket",
  "point",
  "pointed",
  "points",
  "poland",
  "polarity",
  "police",
  "policies",
  "policy",
  "polish",
  "political",
  "politics",
  "pool",
  "poor",
  "pop",
  "popular",
  "population",
  "por",
  "porn",
  "port",
  "portfolio",
  "portion",
  "portland",
  "portugal",
  "portuguese",
  "position",
  "positions",
  "positive",
  "possession",
  "possibilities",
  "possibility",
  "possible",
  "possibly",
  "post",
  "postage",
  "postal",
  "posted",
  "poster",
  "posters",
  "postfach",
  "posting",
  "postings",
  "postscript",
  "potential",
  "potentially",
  "pounds",
  "pour",
  "power",
  "powerful",
  "powers",
  "pp",
  "pr",
  "practical",
  "practically",
  "practice",
  "practices",
  "pragmatic",
  "pragmatics",
  "prc",
  "pre",
  "preceding",
  "predicate",
  "predicates",
  "predictions",
  "prefer",
  "preferably",
  "preference",
  "preferences",
  "preferred",
  "preliminary",
  "premier",
  "premiere",
  "premium",
  "preparation",
  "prepare",
  "prepared",
  "preparing",
  "preregistration",
  "prescription",
  "presence",
  "present",
  "presentation",
  "presentations",
  "presented",
  "presenters",
  "presenting",
  "presently",
  "presents",
  "president",
  "press",
  "pressure",
  "presumably",
  "pretty",
  "prevent",
  "previous",
  "previously",
  "price",
  "priced",
  "prices",
  "pricing",
  "primarily",
  "primary",
  "prime",
  "princeton",
  "principal",
  "principle",
  "principles",
  "print",
  "printed",
  "printer",
  "printing",
  "prior",
  "priority",
  "privacy",
  "private",
  "prize",
  "pro",
  "probably",
  "problem",
  "problems",
  "procedure",
  "procedures",
  "proceed",
  "proceedings",
  "process",
  "processed",
  "processes",
  "processing",
  "processor",
  "produce",
  "produced",
  "producer",
  "producing",
  "product",
  "production",
  "productive",
  "products",
  "prof",
  "professional",
  "professionals",
  "professor",
  "profile",
  "profiled",
  "profit",
  "profitable",
  "profits",
  "program",
  "programme",
  "programming",
  "programs",
  "progress",
  "progressive",
  "prohibited",
  "project",
  "projections",
  "projects",
  "promise",
  "promised",
  "promote",
  "promotion",
  "promotional",
  "promotions",
  "prompt",
  "pronoun",
  "pronouns",
  "pronunciation",
  "proof",
  "proper",
  "properly",
  "properties",
  "property",
  "proposal",
  "proposals",
  "propose",
  "proposed",
  "proprietary",
  "prosodic",
  "prosody",
  "prospective",
  "prospects",
  "protect",
  "protection",
  "proto",
  "protocol",
  "prove",
  "proved",
  "proven",
  "provide",
  "provided",
  "provider",
  "providers",
  "provides",
  "providing",
  "ps",
  "psycholinguistic",
  "psycholinguistics",
  "psychological",
  "psychology",
  "pt",
  "pub",
  "public",
  "publication",
  "publications",
  "publicity",
  "publish",
  "published",
  "publisher",
  "publishers",
  "publishing",
  "pull",
  "purchase",
  "purchased",
  "purchasing",
  "pure",
  "purely",
  "purpose",
  "purposes",
  "pursue",
  "push",
  "put",
  "puts",
  "putting",
  "qualifications",
  "qualified",
  "qualify",
  "quality",
  "quantitative",
  "quarter",
  "quarterly",
  "que",
  "quebec",
  "queries",
  "query",
  "question",
  "questions",
  "qui",
  "quick",
  "quickly",
  "quit",
  "quite",
  "quote",
  "quoted",
  "quotes",
  "ra",
  "rac",
  "race",
  "radio",
  "ragga",
  "raise",
  "raised",
  "raising",
  "ram",
  "ran",
  "random",
  "range",
  "rank",
  "rapid",
  "rapidly",
  "rare",
  "rate",
  "rated",
  "rates",
  "rather",
  "rating",
  "ratings",
  "ratio",
  "ray",
  "raymond",
  "razor",
  "razorusers",
  "razoruserslistssourceforgenet",
  "rd",
  "re",
  "reach",
  "reached",
  "read",
  "reader",
  "readers",
  "reading",
  "readings",
  "ready",
  "real",
  "realistic",
  "reality",
  "realize",
  "really",
  "realtime",
  "reason",
  "reasonable",
  "reasoning",
  "reasons",
  "recall",
  "receipt",
  "receive",
  "received",
  "receiving",
  "recent",
  "recently",
  "reception",
  "recipient",
  "recipients",
  "recognition",
  "recognize",
  "recognized",
  "recommend",
  "recommendation",
  "recommendations",
  "recommended",
  "reconstruction",
  "record",
  "recorded",
  "records",
  "recovery",
  "recruit",
  "recruiting",
  "red",
  "redhat",
  "reduce",
  "reduced",
  "reduction",
  "reduplication",
  "ref",
  "refer",
  "reference",
  "referenced",
  "references",
  "referred",
  "referring",
  "refers",
  "refinance",
  "reflect",
  "reflects",
  "reform",
  "refund",
  "regard",
  "regarding",
  "regardless",
  "regards",
  "region",
  "regional",
  "register",
  "registered",
  "registration",
  "regular",
  "regularly",
  "regulatory",
  "relate",
  "related",
  "relating",
  "relation",
  "relations",
  "relationship",
  "relationships",
  "relative",
  "relatively",
  "relatives",
  "relax",
  "release",
  "released",
  "releases",
  "relevance",
  "relevant",
  "reliable",
  "relief",
  "religious",
  "rely",
  "remain",
  "remaining",
  "remains",
  "remarks",
  "remember",
  "reminder",
  "remote",
  "removal",
  "remove",
  "removed",
  "ren",
  "repair",
  "repeat",
  "replace",
  "replaced",
  "replacement",
  "replies",
  "reply",
  "report",
  "reported",
  "reporting",
  "reports",
  "represent",
  "representation",
  "representations",
  "representative",
  "representatives",
  "represented",
  "representing",
  "represents",
  "republic",
  "request",
  "requested",
  "requesting",
  "requests",
  "require",
  "required",
  "requirement",
  "requirements",
  "requires",
  "research",
  "researchers",
  "resell",
  "reservation",
  "reservations",
  "reserve",
  "reserved",
  "reserves",
  "residents",
  "resolution",
  "resolve",
  "resort",
  "resource",
  "resources",
  "respect",
  "respective",
  "respectively",
  "respond",
  "responded",
  "respondents",
  "response",
  "responses",
  "responsibilities",
  "responsibility",
  "responsible",
  "rest",
  "restricted",
  "restrictions",
  "resuits",
  "result",
  "resulting",
  "results",
  "resume",
  "retail",
  "retirement",
  "retrieval",
  "return",
  "returned",
  "returns",
  "reuters",
  "revealed",
  "revenue",
  "revenues",
  "review",
  "reviewed",
  "reviewer",
  "reviewers",
  "reviewing",
  "reviews",
  "revised",
  "revision",
  "rh",
  "rice",
  "rich",
  "richard",
  "rick",
  "right",
  "rights",
  "rise",
  "risk",
  "risks",
  "rita",
  "rival",
  "river",
  "rm",
  "road",
  "rob",
  "robert",
  "roberto",
  "roberts",
  "robin",
  "robust",
  "rock",
  "rocket",
  "roger",
  "rogers",
  "role",
  "roles",
  "rolex",
  "roll",
  "rom",
  "roma",
  "roman",
  "romance",
  "ron",
  "ronald",
  "room",
  "rooms",
  "root",
  "roots",
  "rose",
  "ross",
  "roughly",
  "round",
  "routledge",
  "royal",
  "rpm",
  "rpmlist",
  "rs",
  "rto",
  "rug",
  "rule",
  "rules",
  "run",
  "running",
  "runs",
  "russell",
  "russia",
  "russian",
  "rutgers",
  "ruth",
  "sa",
  "saarbruecken",
  "safe",
  "safety",
  "said",
  "sake",
  "salary",
  "sale",
  "sales",
  "salford",
  "sally",
  "same",
  "sample",
  "samples",
